# Taps
tap "steipete/tap"

# Shell & Terminal
brew "fish"
brew "zellij"

# Git & GitHub
brew "gh"
brew "git-filter-repo"

# Dev - Languages & Runtimes
brew "go"
brew "node"
brew "pnpm"
brew "openjdk@17"
brew "uv"

# Dev - Build Tools
brew "cmake"
brew "gcc"

# Dev - Database
cask "pgadmin4"
cask "sqlitestudio"

# Security & Networking
brew "nmap"
cask "mullvad-vpn"
cask "tailscale-app"

# Reverse Engineering
brew "aarch64-elf-gcc"
brew "apktool"
brew "dex2jar"
brew "jadx"
brew "vineflower"
uv "frida-tools"

# Android
cask "android-platform-tools"
cask "android-studio"

# Media
brew "ffmpeg@7", link: true
brew "streamlink"
cask "iina"
cask "obs"
cask "transmission"
cask "vlc"

# GUI Toolkit deps
brew "glib"
brew "cairo"
brew "pango"
brew "gtk+"

# System Utilities
brew "coreutils"
brew "findutils"
brew "grep"
brew "htop"
brew "jq"
brew "libmagic"
brew "lsd"
brew "neovim"
brew "playwright-cli"
brew "ripgrep"
brew "tree"
brew "watch"
brew "yadm"

# Browsers
cask "chromium"
cask "firefox"
cask "google-chrome"

# Communication
cask "discord"
cask "microsoft-teams"
cask "telegram"
cask "whatsapp"

# Productivity
cask "bitwarden"
cask "cyberduck"
cask "obsidian"
cask "sublime-text"

# Dev Tools (GUI)
cask "claude-code"
cask "codexbar"
cask "visual-studio-code"

# Terminal Emulators
cask "ghostty"
cask "iterm2"
cask "kitty"

# System
cask "basictex"
cask "istat-menus"
cask "orbstack"
cask "rar"

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "repreng.csv"
vscode "the0807.uv-toolkit"
vscode "tomoki1207.pdf"
vscode "wabiloo.m3u8-hls-vscode"
vscode "yy0931.vscode-sqlite3-editor"
